<template>
  <b-container class="mt-5">
    <b-row>
      <b-col cols="12">
        <p class="b">ข้อมูลโรคเบาหวาน</p>
        <hr class="my-4" />
        <p class="p">โรคเบาหวานคืออะไร?</p>
        <p class="q">
          เป็นภาวะที่ร่างกายมีระดับน้ำตาลในเลือดสูงเป็นเวลานาน
          เนื่องจากขาดฮอร์โมนอินซูลิน ซึ่งมีผลต่อการทำงานของระบบต่างๆในร่างกาย
        </p>

        <b-img src="~assets/55.jpg" fluid center alt="Responsive image" />

        <p class="p">โรคเบาหวานแบ่งออกเป็น 4 ประเภท</p>
        <ul class="r">
          <li class="s">เบาหวานประเภทที่ 1</li>
          <p class="q">
            เกิดจากตับอ่อนไม่สามารถสร้างอินซูลินได้
            ซึ่งถ้าขาดอินซูลินหรือน้ำตาลในเลือดสูง อาจหมดสติ
            และเสียชีวิตได้อย่างเฉียบพลัน
          </p>
          <li class="s">เบาหวานประเภทที่ 2</li>
          <p class="q">
            เกิดจากตับอ่อนไม่สามารถสร้างอินซูลินไปใช้ได้อย่างเพียงพอ
          </p>
          <li class="s">เบาหวานประเภทที่ 3</li>
          <p class="q">ประเภทนี้เป็นเบาหวานระหว่างตั้งครรภ์</p>
          <li class="s">เบาหวานประเภทที่ 4</li>
          <p class="q">
            เกิดจากความผิดปกติของสารพันธุกรรม จากยา หรือโรคของทางตับอ่อน
          </p>
        </ul>

        <p class="p">สาเหตุของการเกิดโรคเบาหวาน</p>
        <p class="q">
          สาเหตุของโรคเบาหวานมีหลายปัจจัยร่วมกันทั้งปัจจัยทางพันธุกรรมและปัจจัยสิ่งแวดล้อม
          เช่น
        </p>
        <ol class="r">
          <li class="q">กรรมพันธุ์</li>
          <li class="q">
            น้ำหนักเกิน ความอ้วน ขาดการเคลื่อนไหว ขาดการออกกำลังกาย
          </li>
          <li class="q">อายุที่มากขึ้น มีโอกาสเป็นเบาหวานได้มากขึ้น</li>
          <li class="q">ตับอ่อนอักเสบ ได้รับการผ่าตัดตับอ่อน</li>
          <li class="q">
            การติดเชื้อไวรัสบางชนิด เช่น หัด หัดเยอรมัน คางทูม
            ซึ่งมีผลต่อตับอ่อน
          </li>
          <li class="q">ความเครียดเรื้อรัง</li>
          <li class="q">
            การได้รับยาบางชนิด
            ทำให้มีการสร้างน้ำตาลมากขึ้นหรือการตอบสนองของอินซูลินได้ไม่ดี
          </li>
          <li class="q">
            การตั้งครรภ์ เนื่องจากมีการสร้างฮอร์โมนจากรกหลายชนิด
            ซึ่งมีผลยับยั้งการทำงานของอินซูลิน
          </li>
        </ol>

        <p class="p">ใครบ้างที่เสี่ยงเบาหวาน</p>
        <ul class="r">
          <li class="q">อายุมากกว่า 45 ปีขึ้นไป</li>
          <li class="q">มีประวัติคนในครอบครัวเป็นโรคเบาหวาน</li>
          <li class="q">เป็นผู้มีน้ำหนักมาก</li>
          <li class="q">ความดันโลหิตสูง</li>
          <li class="q">ไม่ออกกำลังกาย</li>
          <li class="q">ดื่มสุรา</li>
          <li class="q">สูบบุหรี่</li>
          <li class="q">
            ผู้ป่วยที่มีประวัติเป็นโรคหลอดเลือดหัวใจ, หลอดเลือดสมอง
          </li>
        </ul>

        <p class="p">อาการของเบาหวาน</p>
        <ul class="r">
          <li class="q">ปัสสาวะบ่อย</li>
          <li class="q">กระหายน้ำ</li>
          <li class="q">อ่อนเพลีย และน้ำหนักลด</li>
          <li class="q">หิวบ่อย</li>
          <li class="q">คันตามตัว ติดเชื้อได้ง่าย</li>
          <li class="q">ตาพร่าเห็นภาพซ้อน</li>
          <li class="q">ปลายมือ ปลายเท้าชา</li>
        </ul>

        <p class="p">การรักษาโรคเบาหวาน</p>
        <p class="q">
          โรคเบาหวานเป็นโรคเรื้อรัง ซึ่งยังไม่มีทางรักษาให้ขายขาด
          การรักษาจึงเพื่อรักษาระดับน้ำตาลในเลือดให้ใกล้เคียงเกณฑ์ปกติให้มากที่สุด
          ซึ่งสิ่งสำคัญที่ผู้ป่วยโรคเบาหวานควรปฏิบัติคือ พยายามงดอาหารรสจัด
          ไม่ว่าจะเป็นหวาน มัน หรือเค็ม รับประทานผัก
          และผลไม้เพื่อเพิ่มกากใยอาหาร ออกกำลังกายเป็นประจำ งดสูบบุหรี่
          และงดดื่มสุรา
        </p>
      </b-col>
    </b-row>
  </b-container>
</template>

<script>
export default {
  layout: 'headerguest',
  middlewares: 'notAdmin',
}
</script>

<style>
/* import font Kanit */
@import url('https://fonts.googleapis.com/css2?family=Kanit:ital,wght@0,100;0,200;0,300;0,400;0,500;0,600;0,700;0,800;0,900;1,100;1,200;1,300;1,400;1,500;1,600;1,700;1,800;1,900&display=swap');
/* import font K2D */
@import url('https://fonts.googleapis.com/css2?family=K2D:ital,wght@0,100;0,200;0,300;0,400;0,500;0,600;0,700;0,800;1,100;1,200;1,300;1,400;1,500;1,600;1,700;1,800&display=swap');

.b {
  color: darkslategray;
  font-family: 'K2D', sans-serif;
  font-size: 45px;
  text-align: center;
}

.p {
  color: black;
  font-family: 'K2D', sans-serif;
  font-size: 30px;
  font-weight: bold;
  margin-top: 50px;
}

.s {
  color: black;
  font-family: 'K2D', sans-serif;
  font-size: 25px;
  font-weight: bold;
}

.q {
  color: darkslategray;
  font-family: 'K2D', sans-serif;
  font-size: 25px;
}

ul.r {
  list-style-position: outside;
}
</style>
